# ==========================================================================
# ==   清空软件残留信息
# ==========================================================================

# 退出之前仿真
quit -sim

# 清空信息
.main clear

# ==========================================================================
# ==   建立工程并仿真
# ==========================================================================

# 建立新的工程库
vlib work

# 映射逻辑库到物理目录
vmap work work

# 编译文件
vlog +incdir+./../rtl_us/  +define+MODELSIM    ./tb_cpu_core.sv
vlog +incdir+./../rtl_us/  +define+HDL_SIM     ./../rtl_us/*.v

#
vsim -voptargs=+acc work.tb_cpu_core
#vsim -novopt work.tb_core


# ==========================================================================
# ==   加载波形
# ==========================================================================

# 添加波形，高度30，以unsigned格式显示                        *** 请修改路径名 ***

